app/controllers/notes_controller.rb

  def index
    @notes = Notes.all
---
SELECT "notes".* FROM "notes"

  def create
    notes_params = params[:note]
    note = Notes.new
    note.from = notes_params[:from]
    note.title = notes_params[:title]
    note.content = notes_params[:content]
    note.save
---
INSERT INTO "notes" ("content", "created_at", "from", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Best in the world!"], ["created_at", "2014-07-09 09:17:38.007088"], ["from", "Iron Man"], ["title", "Kit Kat"], ["updated_at", "2014-07-09 09:17:38.007088"]]